app/helpers/sessions_helper.rb

  def current_user
    User.find_by(id: session[:user_id]) if logged_in?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]