app/controllers/users_controller.rb

  def create
     #byebug
     #@user = User.create name: ""
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)